```
krishna@turbotindias-MacBook-Pro aws_check_tagging % terraform apply --var-file=demo.tfvars
var.turbot_profile
  Enter profile matching your turbot cli credentials.

  Enter a value: punisher


An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # turbot_policy_setting.default_tag_template["aws-ec2-instance"] will be created
  + resource "turbot_policy_setting" "default_tag_template" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<~EOT
            # Bring in environment metadata / attributes
            Name: "{{ $.resource.turbot.title }}"
            # Enforce selection of values, set to "Non-Compliant" if out of bounds
            Environment: "{% if $.resource.turbot.tags['Environment'] in ['Dev', 'QA', 'Prod', 'Temp'] %}{{ $.resource.turbot.tags['Environment'] }}{% else %}Non-Compliant Tag{% endif %}"
            # Actor who created the resource
            CreatedByActor: "{% if $.resource.creator.items[0].actor.identity.turbot.title == 'Unidentified Identity' %}{{ $.resource.creator.items[0].actor.alternatePersona }}{% else %}{{ $.resource.creator.items[0].actor.identity.turbot.title }}{% endif %}"
            # Creation Timestamp
            CreatedByTime: "{{ $.resource.creator.items[0].turbot.createTimestamp }}"
        EOT
      + template_input               = <<~EOT
            {
              resource {
                turbot {
                  title
                  tags
                }
                creator: notifications(filter: "sort:version_id limit:1") {
                  items {
                    actor {
                      alternatePersona
                      identity {
                        turbot {
                          title
                        }
                      }
                    }
                    turbot {
                      createTimestamp
                    }
                  }
                }
              }
            }
        EOT
      + type                         = "tmod:@turbot/aws-ec2#/policy/types/instanceTagsTemplate"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.default_tag_template["aws-ec2-snapshot"] will be created
  + resource "turbot_policy_setting" "default_tag_template" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<~EOT
            # Bring in environment metadata / attributes
            Name: "{{ $.resource.turbot.title }}"
            # Enforce selection of values, set to "Non-Compliant" if out of bounds
            Environment: "{% if $.resource.turbot.tags['Environment'] in ['Dev', 'QA', 'Prod', 'Temp'] %}{{ $.resource.turbot.tags['Environment'] }}{% else %}Non-Compliant Tag{% endif %}"
            # Actor who created the resource
            CreatedByActor: "{% if $.resource.creator.items[0].actor.identity.turbot.title == 'Unidentified Identity' %}{{ $.resource.creator.items[0].actor.alternatePersona }}{% else %}{{ $.resource.creator.items[0].actor.identity.turbot.title }}{% endif %}"
            # Creation Timestamp
            CreatedByTime: "{{ $.resource.creator.items[0].turbot.createTimestamp }}"
        EOT
      + template_input               = <<~EOT
            {
              resource {
                turbot {
                  title
                  tags
                }
                creator: notifications(filter: "sort:version_id limit:1") {
                  items {
                    actor {
                      alternatePersona
                      identity {
                        turbot {
                          title
                        }
                      }
                    }
                    turbot {
                      createTimestamp
                    }
                  }
                }
              }
            }
        EOT
      + type                         = "tmod:@turbot/aws-ec2#/policy/types/snapshotTagsTemplate"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.default_tag_template["aws-ec2-volume"] will be created
  + resource "turbot_policy_setting" "default_tag_template" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<~EOT
            # Bring in environment metadata / attributes
            Name: "{{ $.resource.turbot.title }}"
            # Enforce selection of values, set to "Non-Compliant" if out of bounds
            Environment: "{% if $.resource.turbot.tags['Environment'] in ['Dev', 'QA', 'Prod', 'Temp'] %}{{ $.resource.turbot.tags['Environment'] }}{% else %}Non-Compliant Tag{% endif %}"
            # Actor who created the resource
            CreatedByActor: "{% if $.resource.creator.items[0].actor.identity.turbot.title == 'Unidentified Identity' %}{{ $.resource.creator.items[0].actor.alternatePersona }}{% else %}{{ $.resource.creator.items[0].actor.identity.turbot.title }}{% endif %}"
            # Creation Timestamp
            CreatedByTime: "{{ $.resource.creator.items[0].turbot.createTimestamp }}"
        EOT
      + template_input               = <<~EOT
            {
              resource {
                turbot {
                  title
                  tags
                }
                creator: notifications(filter: "sort:version_id limit:1") {
                  items {
                    actor {
                      alternatePersona
                      identity {
                        turbot {
                          title
                        }
                      }
                    }
                    turbot {
                      createTimestamp
                    }
                  }
                }
              }
            }
        EOT
      + type                         = "tmod:@turbot/aws-ec2#/policy/types/volumeTagsTemplate"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.default_tag_template["aws-lambda-function"] will be created
  + resource "turbot_policy_setting" "default_tag_template" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<~EOT
            # Bring in environment metadata / attributes
            Name: "{{ $.resource.turbot.title }}"
            # Enforce selection of values, set to "Non-Compliant" if out of bounds
            Environment: "{% if $.resource.turbot.tags['Environment'] in ['Dev', 'QA', 'Prod', 'Temp'] %}{{ $.resource.turbot.tags['Environment'] }}{% else %}Non-Compliant Tag{% endif %}"
            # Actor who created the resource
            CreatedByActor: "{% if $.resource.creator.items[0].actor.identity.turbot.title == 'Unidentified Identity' %}{{ $.resource.creator.items[0].actor.alternatePersona }}{% else %}{{ $.resource.creator.items[0].actor.identity.turbot.title }}{% endif %}"
            # Creation Timestamp
            CreatedByTime: "{{ $.resource.creator.items[0].turbot.createTimestamp }}"
        EOT
      + template_input               = <<~EOT
            {
              resource {
                turbot {
                  title
                  tags
                }
                creator: notifications(filter: "sort:version_id limit:1") {
                  items {
                    actor {
                      alternatePersona
                      identity {
                        turbot {
                          title
                        }
                      }
                    }
                    turbot {
                      createTimestamp
                    }
                  }
                }
              }
            }
        EOT
      + type                         = "tmod:@turbot/aws-lambda#/policy/types/functionTagsTemplate"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.default_tag_template["aws-s3-bucket"] will be created
  + resource "turbot_policy_setting" "default_tag_template" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<~EOT
            # Bring in environment metadata / attributes
            Name: "{{ $.resource.turbot.title }}"
            # Enforce selection of values, set to "Non-Compliant" if out of bounds
            Environment: "{% if $.resource.turbot.tags['Environment'] in ['Dev', 'QA', 'Prod', 'Temp'] %}{{ $.resource.turbot.tags['Environment'] }}{% else %}Non-Compliant Tag{% endif %}"
            # Actor who created the resource
            CreatedByActor: "{% if $.resource.creator.items[0].actor.identity.turbot.title == 'Unidentified Identity' %}{{ $.resource.creator.items[0].actor.alternatePersona }}{% else %}{{ $.resource.creator.items[0].actor.identity.turbot.title }}{% endif %}"
            # Creation Timestamp
            CreatedByTime: "{{ $.resource.creator.items[0].turbot.createTimestamp }}"
        EOT
      + template_input               = <<~EOT
            {
              resource {
                turbot {
                  title
                  tags
                }
                creator: notifications(filter: "sort:version_id limit:1") {
                  items {
                    actor {
                      alternatePersona
                      identity {
                        turbot {
                          title
                        }
                      }
                    }
                    turbot {
                      createTimestamp
                    }
                  }
                }
              }
            }
        EOT
      + type                         = "tmod:@turbot/aws-s3#/policy/types/bucketTagsTemplate"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.default_tag_template["aws-vpc-core-vpc"] will be created
  + resource "turbot_policy_setting" "default_tag_template" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<~EOT
            # Bring in environment metadata / attributes
            Name: "{{ $.resource.turbot.title }}"
            # Enforce selection of values, set to "Non-Compliant" if out of bounds
            Environment: "{% if $.resource.turbot.tags['Environment'] in ['Dev', 'QA', 'Prod', 'Temp'] %}{{ $.resource.turbot.tags['Environment'] }}{% else %}Non-Compliant Tag{% endif %}"
            # Actor who created the resource
            CreatedByActor: "{% if $.resource.creator.items[0].actor.identity.turbot.title == 'Unidentified Identity' %}{{ $.resource.creator.items[0].actor.alternatePersona }}{% else %}{{ $.resource.creator.items[0].actor.identity.turbot.title }}{% endif %}"
            # Creation Timestamp
            CreatedByTime: "{{ $.resource.creator.items[0].turbot.createTimestamp }}"
        EOT
      + template_input               = <<~EOT
            {
              resource {
                turbot {
                  title
                  tags
                }
                creator: notifications(filter: "sort:version_id limit:1") {
                  items {
                    actor {
                      alternatePersona
                      identity {
                        turbot {
                          title
                        }
                      }
                    }
                    turbot {
                      createTimestamp
                    }
                  }
                }
              }
            }
        EOT
      + type                         = "tmod:@turbot/aws-vpc-core#/policy/types/vpcTagsTemplate"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.default_tag_template["aws-vpc-security-securityGroup"] will be created
  + resource "turbot_policy_setting" "default_tag_template" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<~EOT
            # Bring in environment metadata / attributes
            Name: "{{ $.resource.turbot.title }}"
            # Enforce selection of values, set to "Non-Compliant" if out of bounds
            Environment: "{% if $.resource.turbot.tags['Environment'] in ['Dev', 'QA', 'Prod', 'Temp'] %}{{ $.resource.turbot.tags['Environment'] }}{% else %}Non-Compliant Tag{% endif %}"
            # Actor who created the resource
            CreatedByActor: "{% if $.resource.creator.items[0].actor.identity.turbot.title == 'Unidentified Identity' %}{{ $.resource.creator.items[0].actor.alternatePersona }}{% else %}{{ $.resource.creator.items[0].actor.identity.turbot.title }}{% endif %}"
            # Creation Timestamp
            CreatedByTime: "{{ $.resource.creator.items[0].turbot.createTimestamp }}"
        EOT
      + template_input               = <<~EOT
            {
              resource {
                turbot {
                  title
                  tags
                }
                creator: notifications(filter: "sort:version_id limit:1") {
                  items {
                    actor {
                      alternatePersona
                      identity {
                        turbot {
                          title
                        }
                      }
                    }
                    turbot {
                      createTimestamp
                    }
                  }
                }
              }
            }
        EOT
      + type                         = "tmod:@turbot/aws-vpc-security#/policy/types/securityGroupTagsTemplate"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_tag_policies["aws-ec2-instance"] will be created
  + resource "turbot_policy_setting" "set_resource_tag_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-ec2#/policy/types/instanceTags"
      + value                        = "Check: Tags are correct"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_tag_policies["aws-ec2-snapshot"] will be created
  + resource "turbot_policy_setting" "set_resource_tag_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-ec2#/policy/types/snapshotTags"
      + value                        = "Check: Tags are correct"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_tag_policies["aws-ec2-volume"] will be created
  + resource "turbot_policy_setting" "set_resource_tag_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-ec2#/policy/types/volumeTags"
      + value                        = "Check: Tags are correct"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_tag_policies["aws-lambda-function"] will be created
  + resource "turbot_policy_setting" "set_resource_tag_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-lambda#/policy/types/functionTags"
      + value                        = "Check: Tags are correct"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_tag_policies["aws-s3-bucket"] will be created
  + resource "turbot_policy_setting" "set_resource_tag_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-s3#/policy/types/bucketTags"
      + value                        = "Check: Tags are correct"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_tag_policies["aws-vpc-core-vpc"] will be created
  + resource "turbot_policy_setting" "set_resource_tag_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-vpc-core#/policy/types/vpcTags"
      + value                        = "Check: Tags are correct"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_tag_policies["aws-vpc-security-securityGroup"] will be created
  + resource "turbot_policy_setting" "set_resource_tag_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-vpc-security#/policy/types/securityGroupTags"
      + value                        = "Check: Tags are correct"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_smart_folder.aws_tagging will be created
  + resource "turbot_smart_folder" "aws_tagging" {
      + description = "Defines sets of policies for the AWS Check Tagging Policies"
      + id          = (known after apply)
      + parent      = "tmod:@turbot/turbot#/"
      + parent_akas = (known after apply)
      + title       = "AWS Check Tagging Policies"
    }

Plan: 15 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

turbot_smart_folder.aws_tagging: Creating...
turbot_smart_folder.aws_tagging: Creation complete after 2s [id=215809179844735]
turbot_policy_setting.set_resource_tag_policies["aws-ec2-instance"]: Creating...
turbot_policy_setting.default_tag_template["aws-lambda-function"]: Creating...
turbot_policy_setting.set_resource_tag_policies["aws-ec2-volume"]: Creating...
turbot_policy_setting.default_tag_template["aws-vpc-core-vpc"]: Creating...
turbot_policy_setting.default_tag_template["aws-ec2-snapshot"]: Creating...
turbot_policy_setting.set_resource_tag_policies["aws-vpc-core-vpc"]: Creating...
turbot_policy_setting.default_tag_template["aws-vpc-security-securityGroup"]: Creating...
turbot_policy_setting.set_resource_tag_policies["aws-lambda-function"]: Creating...
turbot_policy_setting.default_tag_template["aws-ec2-instance"]: Creating...
turbot_policy_setting.default_tag_template["aws-ec2-volume"]: Creating...
turbot_policy_setting.default_tag_template["aws-vpc-core-vpc"]: Creation complete after 2s [id=215809182364806]
turbot_policy_setting.set_resource_tag_policies["aws-lambda-function"]: Creation complete after 2s [id=215809182399626]
turbot_policy_setting.set_resource_tag_policies["aws-s3-bucket"]: Creating...
turbot_policy_setting.set_resource_tag_policies["aws-vpc-security-securityGroup"]: Creating...
turbot_policy_setting.default_tag_template["aws-ec2-instance"]: Creation complete after 5s [id=215809184945312]
turbot_policy_setting.default_tag_template["aws-vpc-security-securityGroup"]: Creation complete after 5s [id=215809184931997]
turbot_policy_setting.set_resource_tag_policies["aws-ec2-snapshot"]: Creating...
turbot_policy_setting.default_tag_template["aws-s3-bucket"]: Creating...
turbot_policy_setting.default_tag_template["aws-ec2-snapshot"]: Creation complete after 5s [id=215809185296550]
turbot_policy_setting.set_resource_tag_policies["aws-vpc-security-securityGroup"]: Creation complete after 3s [id=215809185941676]
turbot_policy_setting.default_tag_template["aws-ec2-volume"]: Creation complete after 6s [id=215809186540731]
turbot_policy_setting.set_resource_tag_policies["aws-s3-bucket"]: Creation complete after 4s [id=215809186631871]
turbot_policy_setting.set_resource_tag_policies["aws-ec2-instance"]: Creation complete after 6s [id=215809186418871]
turbot_policy_setting.set_resource_tag_policies["aws-ec2-snapshot"]: Creation complete after 1s [id=215809186958537]
turbot_policy_setting.default_tag_template["aws-lambda-function"]: Creation complete after 6s [id=215809186088113]
turbot_policy_setting.set_resource_tag_policies["aws-ec2-volume"]: Creation complete after 7s [id=215809186737348]
turbot_policy_setting.set_resource_tag_policies["aws-vpc-core-vpc"]: Creation complete after 7s [id=215809187418318]
turbot_policy_setting.default_tag_template["aws-s3-bucket"]: Creation complete after 2s [id=215809187491026]

Apply complete! Resources: 15 added, 0 changed, 0 destroyed.

Outputs:

resource_tags = {
  "aws-ec2-instance" = "Check: Tags are correct"
  "aws-ec2-snapshot" = "Check: Tags are correct"
  "aws-ec2-volume" = "Check: Tags are correct"
  "aws-lambda-function" = "Check: Tags are correct"
  "aws-s3-bucket" = "Check: Tags are correct"
  "aws-vpc-core-vpc" = "Check: Tags are correct"
  "aws-vpc-security-securityGroup" = "Check: Tags are correct"
}
smart_folder_description = Defines sets of policies for the AWS Check Tagging Policies
smart_folder_name = AWS Check Tagging Policies
smart_folder_parent_resource = tmod:@turbot/turbot#/
turbot_profile = punisher
